snlkuharlocal/src/DataProcessors/ВыгрузкаОстатковЕЕдляФР/ВыгрузкаОстатковЕЕдляФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаОстатковЕЕдляФР</name>
  <attributes>
    <name>m_Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>m_IsTruncated</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>m_NextContinuationToken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>фОтладка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>BucketObjects</name>
    <attributes>
      <name>isFolder</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LastModified</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ETag</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Size</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>StorageClass</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectShortName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/DataProcessors/ВыгрузкаОстатковЕЕдляФР/Forms/ФормаТонкая/Module.bsl
&НаКлиенте
Процедура ПолучитьСписокФайлов(Команда)
	ТекДанные = Элементы.BucketObjects.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.IsFolder Тогда
		Префикс = СокрЛП(ТекДанные.key); 			
	Иначе
		Префикс = "";
	КонецЕсли; 
	
	ПолучитьСписокФайлов_НаСервере(Префикс);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокФайлов_НаСервере(Префикс)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ПолучитьСписокФайлов(Префикс);	
	
	Объект.BucketObjects.Загрузить(ОбработкаОбъект.BucketObjects.Выгрузить());	
КонецПроцедуры


&НаКлиенте
Процедура BucketObjects_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ТекДанные = Элементы.BucketObjects.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		рЗапроса = ПрочитатьФайлИзКорзины(ТекДанные.Key);	
		
		Если рЗапроса.Успешно Тогда
			Время = (ТекущаяУниверсальнаяДатаВМиллисекундах()-рЗапроса.Начало);
			
			//рЗапроса.Сообщения.Добавить(СтрШаблон("Время передачи на клиент: '%1' c.", Время/1000));
			
			Терминал = СтрСоединить(рЗапроса.Сообщения, Символы.ПС);
		Иначе
			Сообщить(СтрСоединить(рЗапроса.Ошибки, Символы.ПС));
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПрочитатьФайлИзКорзины(ИмяФайла)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	рЗапроса	= РеквизитФормыВЗначение("Объект").ПрочитатьФайлИзКорзины(ИмяФайла);	
	Время 		= (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало);
	
	рЗапроса.Сообщения.Добавить(СтрШаблон("Время получения из корзины S3: '%1' c.", Время/1000));
	
	Если рЗапроса.Успешно Тогда
		рОстатки = РеквизитФормыВЗначение("Объект").ПрочитатьОстатки(рЗапроса.Данные);
		Объект.Остатки.Очистить();
		Объект.Остатки.Загрузить(рОстатки.Данные);
		
		Для Каждого ТекстСообщения Из рОстатки.Сообщения Цикл
			рЗапроса.Сообщения.Добавить(ТекстСообщения);		
		КонецЦикла;		
	КонецЕсли;
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало);
	рЗапроса.Сообщения.Добавить(СтрШаблон("Полное время загрузки остатков: '%1' c.", Время/1000));	
	//рЗапроса.Сообщения.Добавить("=============================================");	
	
	рЗапроса.Данные = Неопределено;
	рЗапроса.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат рЗапроса;
КонецФункции
